# Tap homebrew/dupes to be able to install updates to the outdated utilities
# that are shipped with macOS.
tap 'homebrew/dupes'

# Allows to install updates automatically.
tap 'domt4/autoupdate'

# GNU utilities.
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'file-formula'
brew 'findutils', args: %w(with-default-names)
brew 'gawk'
brew 'gnu-getopt'
brew 'gnu-indent', args: %w(with-default-names)
brew 'gnu-sed', args: %w(with-default-names)
brew 'gnu-tar', args: %w(with-default-names)
brew 'gnu-which', args: %w(with-default-names)
brew 'gnutls'
brew 'gpatch'
brew 'grep', args: %w(with-default-names)
brew 'gzip'
brew 'less'
brew 'make'
brew 'rsync'
brew 'tree'
brew 'unzip'
brew 'watch'

# QuickLook plugins, https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# FUSE.
tap 'homebrew/fuse'
cask 'osxfuse'
brew 'sshfs'

# Apps without topic directories.
brew 'curl', args: %w(with-libidn with-libssh2 with-nghttp2 with-openssl)
brew 'httpie'
brew 'imagemagick', args: %w(with-webp)
brew 'jid'
brew 'm-cli'
brew 'ncdu'
brew 'nmap'
brew 'p7zip'
brew 'shellcheck'
brew 'speedtest_cli'
brew 'testssl'
brew 'wakeonlan'
brew 'webkit2png'
brew 'xz'

cask 'android-file-transfer'
cask 'anydesk'
cask 'atext'
cask 'bartender'
cask 'bettertouchtool'
cask 'cleanmymac'
cask 'dash'
cask 'dotnet-sdk'
cask 'double-commander'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'google-hangouts'
cask 'hosts'
cask 'hyperdock'
cask 'hyperswitch'
cask 'istat-menus'
cask 'java'
cask 'kap'
cask 'key-codes'
cask 'launchcontrol'
cask 'lumen'
cask 'macdown'
cask 'mono-mdk'
cask 'owncloud'
cask 'paste'
cask 'popclip'
cask 'rider'
cask 'rubymine'
cask 'skype'
cask 'symboliclinker'
cask 'teamviewer'
cask 'vlc'
cask 'xnviewmp'

# Fonts.
tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-hasklig'

# Apps from the Mac App Store.
mas 'Amphetamine', id: 937_984_704
mas 'Better', id: 1_121_192_229
mas 'CleanMyDrive', id: 523_620_159
mas 'EasyRes', id: 688_211_836
mas 'FruitJuice', id: 671_736_912
mas 'Microsoft Remote Desktop', id: 715_768_417
mas 'Monosnap', id: 540_348_655
mas 'Moom', id: 419_330_170
mas 'Newton', id: 1_059_655_371
mas 'PCalc', id: 403_504_866
mas 'Reeder', id: 880_001_334
mas 'Trello', id: 1_278_508_951
mas 'Tweetbot', id: 557_168_941
mas 'WhatsApp', id: 1_147_396_723

puts "\e[31;1mManually install these:\e[0m"
[
  'Roboform: https://www.roboform.com/for-mac'
].each { |app| puts app }
