# Allows to install updates automatically.
tap 'domt4/autoupdate'

# Install updates for all casks.
tap 'buo/cask-upgrade'

# Remove formula and its dependencies with 'brew rmrec <formula>'.
tap 'ggpeti/rmrec'

# GNU utilities.
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'make'
brew 'pidof'
brew 'rsync'
brew 'tree'
brew 'unzip'
brew 'watch'

# QuickLook plugins, https://github.com/sindresorhus/quick-look-plugins
cask 'betterzip'
cask 'mediainfoex'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-video'
cask 'quicklookase'
cask 'suspicious-package'
cask 'syntax-highlight'
cask 'webpquicklook'

tap 'tw93/tap'
brew 'mole'

# FUSE.
tap 'gromgit/homebrew-fuse'
cask 'macfuse'
brew 'sshfs-mac'

# JSON-related.
brew 'jq'
brew 'jqp'
brew 'jid'
brew 'jless'

# AI-related.
brew 'beads'

brew 'codex'
cask 'codex-app'

brew 'ollama'
tap 'danielmarbach/mnemonic-mcp', 'https://github.com/danielmarbach/mnemonic'
brew 'mnemonic-mcp'

cask 'handy'

tap 'typewhisper/tap'
cask 'typewhisper'

# Apps without topic directories.

brew 'b2-tools'
brew 'bitwarden-cli'
brew 'curl'
brew 'doge'
brew 'graphviz'
brew 'grex'
brew 'httpie'
brew 'imagemagick'
brew 'm-cli'
brew 'ncdu'
brew 'nmap'
brew 'opentofu'
brew 'p7zip'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'speedtest_cli'
brew 'sslscan'
brew 'testssl'
brew 'wakeonlan'
brew 'xz'
brew 'yt-dlp'

cask 'aldente'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'anydesk'
cask 'atext'
cask 'banking-4'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'brewy'
cask 'cleanmymac'
cask 'dbgate'
cask 'dockdoor'
cask 'double-commander'
cask 'drawio'
cask 'freecad'
cask 'istat-menus'
cask 'kap'
cask 'keka'
cask 'keyboardcleantool'
cask 'launchcontrol'
cask 'losslesscut'
cask 'maestral'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-teams'
cask 'mqtt-explorer'
cask 'netnewswire'
cask 'nextcloud'
cask 'pika'
cask 'popclip'
cask 'rider'
cask 'signal'
cask 'slack'
cask 'symboliclinker'
cask 'telegram'
cask 'thaw'
cask 'threema@beta'
cask 'timemachineeditor'
cask 'viscosity'
cask 'vnc-viewer'
cask 'whatsapp'
cask 'wireshark-app'
cask 'xnviewmp'
cask 'zoom'

tap 'TheBoredTeam/boring-notch'
cask 'boring-notch'

# Apps from the Mac App Store.
mas 'AS Timer', id: 512_464_723
mas 'Bitwarden', id: 1_352_778_147
mas 'CCMenu 2', id: 603_117_688
mas 'Discovery', id: 1_381_004_916
mas 'EasyRes', id: 688_211_836
mas 'Monosnap', id: 540_348_655
mas 'Moom Classic', id: 419_330_170
mas 'PastePal', id: 1_503_446_680
mas 'PCalc', id: 403_504_866
mas 'PDFgear', id: 6_469_021_132
mas 'Shareful', id: 1_522_267_256
mas 'Spark', id: 1_176_895_641
mas 'Trello', id: 1_278_508_951
mas 'WireGuard', id: 1_451_685_025

# vim: set ft=ruby ts=2 sw=2 et:
